In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\dell\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (1.23.5)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: six>=1.5 in c:\users\dell\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [1]:
import numpy as np
import pandas as pd

In [3]:
pd.__version__

'1.5.3'

In [6]:
#series can only have one dimensional data
#series through list
lst = [1,2,3,4,5]
pd.Series(lst)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
#series through numpy array
arr = np.array([1,2,3,4,5])
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [8]:
#by default the index is from 0 , we can give index from our own end also
pd.Series(data = [ 'A', 'E', 'I', 'O', 'U'], index = [1,2,3,4,5])

1    A
2    E
3    I
4    O
5    U
dtype: object

In [11]:
#series through dictionary
dict = {'A' : 1, 'AA' : 2, 'AAA' : 3}
print(dict)
pd.Series(dict)

{'A': 1, 'AA': 2, 'AAA': 3}

A      1
AA     2
AAA    3
dtype: int64

In [13]:
#Repeat function
#using repeat function along with series
pd.Series(5).repeat(5)

0    5
0    5
0    5
0    5
0    5
dtype: int64

In [14]:
#Reset function
#since in repeat function, same index is repeated so inorder to change the index we use reset funtion
pd.Series(5).repeat(5).reset_index()

   index  0
0      0  5
1      0  5
2      0  5
3      0  5
4      0  5

In [18]:
series = pd.Series([10,20]).repeat([10,5]).reset_index(drop = True)
series

0     10
1     10
2     10
3     10
4     10
5     10
6     10
7     10
8     10
9     10
10    20
11    20
12    20
13    20
14    20
dtype: int64

In [20]:
#accessing the series elements
series[12]

20

In [21]:
series[8]

10

In [22]:
#using slicing
series[2:11]

2     10
3     10
4     10
5     10
6     10
7     10
8     10
9     10
10    20
dtype: int64

In [23]:
#Aggregate function on pandas series
sr = pd.Series([1,2,3,4,5,6])
sr.agg([min,max,sum])

min     1
max     6
sum    21
dtype: int64

In [25]:
#Series Absolute function
sr = pd.Series([1,-2,3,-4,5,6])
sr.abs()

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [36]:
#Astype function
sr

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [37]:
type(sr)

pandas.core.series.Series

In [38]:
type(sr[0])

numpy.int64

In [39]:
sr.astype('float')

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
dtype: float64

In [41]:
#between function - checks which which values lies under given range
sr = pd.Series([1,2,30,50,60,4,3])
print(sr)
sr.between(10,60)

0     1
1     2
2    30
3    50
4    60
5     4
6     3
dtype: int64

0    False
1    False
2     True
3     True
4     True
5    False
6    False
dtype: bool

In [66]:
#String functions
series = pd.Series(["Aastha Pasta ", "Chaudhary"])
print(series)
#1- upper and lower function
print(series.str.upper())
print(series.str.lower())
#2- Len function
print(series.str.len())
#3- Strip function - removes extra spaces
series = series.str.strip()
print(series.str.len())
#4- Split function
series.str.split()[0]
#5- contains function
print(series.str.contains('i'))
print(series.str.contains('a'))
#6- Replace function
print(series.str.replace('A', 'P'))
#7- Count function
print(series.str.count('a'))
#8- EndsWith and StartsWith
print(series.str.endswith('a'))
print(series.str.startswith('C'))
#9-Find function
print(series.str.find('Pasta'))
#10-Converting series into list
print(series.to_list())

0    Aastha Pasta
1        Chaudhary
dtype: object
0    AASTHA PASTA
1        CHAUDHARY
dtype: object
0    aastha pasta
1        chaudhary
dtype: object
0    13
1     9
dtype: int64
0    12
1     9
dtype: int64
0    False
1    False
dtype: bool
0    True
1    True
dtype: bool
0    Pastha Pasta
1       Chaudhary
dtype: object
0    4
1    2
dtype: int64
0     True
1    False
dtype: bool
0    False
1     True
dtype: bool
0    7
1   -1
dtype: int64
['Aastha Pasta', 'Chaudhary']

In [68]:
#PANDAS DATAFRAME
#It works with two dimensional data
#Creating dataframe
list = ['Aastha', 'Pasta', 'Khasta', 'Nasta']
list
pd.DataFrame(list)

        0
0  Aastha
1   Pasta
2  Khasta
3   Nasta

In [77]:
list = [['Aastha',1], ['Pasta',2], ['Khasta',3], ['Nasta',4]]
pd.DataFrame(list)

        0  1
0  Aastha  1
1   Pasta  2
2  Khasta  3
3   Nasta  4

In [78]:
#from dictionary
dict = {'Name' : ['Aastha', 'Anuska'], 'Age' : [22,21]}
pd.DataFrame(dict)

     Name  Age
0  Aastha   22
1  Anuska   21

In [79]:
#specific column
df = pd.DataFrame(dict)
#df[['Name']]

     Name
0  Aastha
1  Anuska

In [83]:
# slicing using iloc and loc
# loc takes the row and column name inorder to slice
df.loc[1: , 'Age': ]

   Age
1   21

In [92]:
#iloc takes the index value
df.iloc[[0,1],[1,]]

   Age
0   22
1   21

In [98]:
#slicing using conditions
df[df['Age'] > 21]

     Name  Age
0  Aastha   22

In [101]:
#column addition in dataframe
#1- using list
l = [1,2]
df['Roll No'] = l
df
#2- using pandas series
series = pd.Series(['GR', 'GR'])
df['Section'] = series
df
#3- using an existing column
df['Updated Roll No'] = df['Roll No'] + 10
df

     Name  Age  Roll No Section  Updated Roll No
0  Aastha   22        1      GR               11
1  Anuska   21        2      GR               12

In [110]:
#column deletion in dataframe
#1- using del
del df['Roll No']
df 
# 2- using pop
df.pop('Section')
df

     Name  Age
0  Aastha   22
1  Anuska   21

In [111]:
#transposing a dataframe
df.T

           0       1
Name  Aastha  Anuska
Age       22      21

In [112]:
#axes function - returns a list with row and column labels
df.axes

[RangeIndex(start=0, stop=2, step=1), Index(['Name', 'Age'], dtype='object')]

In [113]:
#ndim function - gives the dimension of dataframe
df.ndim

2

In [114]:
#shape function
df.shape

(2, 2)

#head function - prints first 5 rows by default
#tail function - prints last 5 rows by default
#empty function - checks if the dataframe is empty or not

In [10]:
#STATISTICAL OR MATHEMATICAL FUNCTIONS
data = {'one' : pd.Series([1,2,3,4]),
        'two' : pd.Series([10,20,30,40]),
        'three' : pd.Series([100,200,300,400]),
        'four' : pd.Series([1000, 2000, 3000, 4000])}
df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [15]:
print(df.tail(2))
#Sum
#df.sum()

   one  two  three  four
2    3   30    300  3000
3    4   40    400  4000

In [117]:
df.mean()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [118]:
df.median()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [126]:
de = pd.DataFrame({'A': [1,2,3,4,5]})
print('A', de['A'].mode())

A 0    1
1    2
2    3
3    4
4    5
Name: A, dtype: int64

In [127]:
df.var()

one      1.666667e+00
two      1.666667e+02
three    1.666667e+04
four     1.666667e+06
dtype: float64

In [128]:
df.std()

one         1.290994
two        12.909944
three     129.099445
four     1290.994449
dtype: float64

In [131]:
#Describe function
data = {'one' : pd.Series([1,2,3,4]),
        'two' : pd.Series([10,20,30,40]),
        'three' : pd.Series([100,200,300,400]),
        'four' : pd.Series([1000, 2000, 3000, 4000]),
        'five' : pd.Series(['A', 'B', 'C', 'D'])
       }
df = pd.DataFrame(data)
df
df.describe()

            one        two       three         four
count  4.000000   4.000000    4.000000     4.000000
mean   2.500000  25.000000  250.000000  2500.000000
std    1.290994  12.909944  129.099445  1290.994449
min    1.000000  10.000000  100.000000  1000.000000
25%    1.750000  17.500000  175.000000  1750.000000
50%    2.500000  25.000000  250.000000  2500.000000
75%    3.250000  32.500000  325.000000  3250.000000
max    4.000000  40.000000  400.000000  4000.000000

In [30]:
#Pipe function - it does the required operation on each data by passing an function
#we can also apply multiple operation at a time
data = {'one' : pd.Series([1,2,3,4]),
        'two' : pd.Series([10,20,30,40]),
        'three' : pd.Series([100,200,300,400]),
        'four' : pd.Series([1000, 2000, 3000, 4000])}
df = pd.DataFrame(data)
df

#we have to define a function inorder to pipe it 
def add_(i,j):
    return i+j

df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [31]:
#now using pipe function adding a specific value to each data
df = df.pipe(add_, 10)
df

   one  two  three  four
0   11   20    110  1010
1   12   30    210  2010
2   13   40    310  3010
3   14   50    410  4010

In [140]:
#Apply function- apply the required function to individual dataframe or the entire dataframe
#It applies the operation element + row column wise
data = {'one' : pd.Series([1,2,3,4]),
        'two' : pd.Series([10,20,30,40]),
        'three' : pd.Series([100,200,300,400]),
        'four' : pd.Series([1000, 2000, 3000, 4000])}
df = pd.DataFrame(data)
df

df.apply(np.mean)

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [141]:
df.apply(lambda x: x.max() - x.min())

one         3
two        30
three     300
four     3000
dtype: int64

In [142]:
#ApplyMap function - applies operation element wise
df.applymap(lambda x: x*100)

   one   two  three    four
0  100  1000  10000  100000
1  200  2000  20000  200000
2  300  3000  30000  300000
3  400  4000  40000  400000

In [34]:
#Working with csv file
data = pd.read_csv("googleplaystore.csv")
data

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159,19M,"10,000+",Free,0,Everyone,Art & Design,"January 7, 2018",1.0.0,4.0.3 and up
1,Coloring book moana,ART_AND_DESIGN,3.9,967,14M,"500,000+",Free,0,Everyone,Art & Design;Pretend Play,"January 15, 2018",2.0.0,4.0.3 and up
2,"U Launcher Lite – FREE Live Cool Themes, Hide ...",ART_AND_DESIGN,4.7,87510,8.7M,"5,000,000+",Free,0,Everyone,Art & Design,"August 1, 2018",1.2.4,4.0.3 and up
3,Sketch - Draw & Paint,ART_AND_DESIGN,4.5,215644,25M,"50,000,000+",Free,0,Teen,Art & Design,"June 8, 2018",Varies with device,4.2 and up
4,Pixel Draw - Number Art Coloring Book,ART_AND_DESIGN,4.3,967,2.8M,"100,000+",Free,0,Everyone,Art & Design;Creativity,"June 20, 2018",1.1,4.4 and up
...,...,...,...,...,...,...,...,...,...,...,...,...,...
10836,Sya9a Maroc - FR,FAMILY,4.5,38,53M,"5,000+",Free,0,Everyone,Education,"July 25, 2017",1.48,4.1 and up
10837,Fr. Mike Schmitz Audio Teachings,FAMILY,5.0,4,3.6M,100+,Free,0,Everyone,Education,"July 6, 2018",1.0,4.1 and up
10838,Parkinson Exercices FR,MEDICAL,NaN,3,9.5M,"1,000+",Free,0,Everyone,Medical,"January 20, 2017",1.0,2.2 and up
10839,The SCP Foundation DB fr nn5n,BOOKS_AND_REFERENCE,4.5,114,Varies with device,"1,000+",Free,0,Mature 17+,Books & Reference,"January 19, 2015",Varies with device,Varies with device
10840,iHoroscope - 2018 Daily Horoscope & Astrology,LIFESTYLE,4.5,398307,19M,"10,000,000+",Free,0,Everyone,Lifestyle,"July 25, 2018",Varies with device,Varies with device

In [3]:
type(data)

pandas.core.frame.DataFrame

In [4]:
data.head(5)

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159,19M,"10,000+",Free,0,Everyone,Art & Design,"January 7, 2018",1.0.0,4.0.3 and up
1,Coloring book moana,ART_AND_DESIGN,3.9,967,14M,"500,000+",Free,0,Everyone,Art & Design;Pretend Play,"January 15, 2018",2.0.0,4.0.3 and up
2,"U Launcher Lite – FREE Live Cool Themes, Hide ...",ART_AND_DESIGN,4.7,87510,8.7M,"5,000,000+",Free,0,Everyone,Art & Design,"August 1, 2018",1.2.4,4.0.3 and up
3,Sketch - Draw & Paint,ART_AND_DESIGN,4.5,215644,25M,"50,000,000+",Free,0,Teen,Art & Design,"June 8, 2018",Varies with device,4.2 and up
4,Pixel Draw - Number Art Coloring Book,ART_AND_DESIGN,4.3,967,2.8M,"100,000+",Free,0,Everyone,Art & Design;Creativity,"June 20, 2018",1.1,4.4 and up

In [6]:
data.columns

Index(['App', 'Category', 'Rating', 'Reviews', 'Size', 'Installs', 'Type',
       'Price', 'Content Rating', 'Genres', 'Last Updated', 'Current Ver',
       'Android Ver'],
      dtype='object')

In [8]:
data['App']

0           Photo Editor & Candy Camera & Grid & ScrapBook
1                                      Coloring book moana
2        U Launcher Lite – FREE Live Cool Themes, Hide ...
3                                    Sketch - Draw & Paint
4                    Pixel Draw - Number Art Coloring Book
                               ...
10836                                     Sya9a Maroc - FR
10837                     Fr. Mike Schmitz Audio Teachings
10838                               Parkinson Exercices FR
10839                        The SCP Foundation DB fr nn5n
10840        iHoroscope - 2018 Daily Horoscope & Astrology
Name: App, Length: 10841, dtype: object

In [35]:
data.info

<bound method DataFrame.info of                                                      App             Category  \
0         Photo Editor & Candy Camera & Grid & ScrapBook       ART_AND_DESIGN
1                                    Coloring book moana       ART_AND_DESIGN
2      U Launcher Lite – FREE Live Cool Themes, Hide ...       ART_AND_DESIGN
3                                  Sketch - Draw & Paint       ART_AND_DESIGN
4                  Pixel Draw - Number Art Coloring Book       ART_AND_DESIGN
...                                                  ...                  ...
10836                                   Sya9a Maroc - FR               FAMILY
10837                   Fr. Mike Schmitz Audio Teachings               FAMILY
10838                             Parkinson Exercices FR              MEDICAL
10839                      The SCP Foundation DB fr nn5n  BOOKS_AND_REFERENCE
10840      iHoroscope - 2018 Daily Horoscope & Astrology            LIFESTYLE

       Rating Reviews                Size     Installs  Type Price  \
0         4.1     159                 19M      10,000+  Free     0
1         3.9     967                 14M     500,000+  Free     0
2         4.7   87510                8.7M   5,000,000+  Free     0
3         4.5  215644                 25M  50,000,000+  Free     0
4         4.3     967                2.8M     100,000+  Free     0
...       ...     ...                 ...          ...   ...   ...
10836     4.5      38                 53M       5,000+  Free     0
10837     5.0       4                3.6M         100+  Free     0
10838     NaN       3                9.5M       1,000+  Free     0
10839     4.5     114  Varies with device       1,000+  Free     0
10840     4.5  398307                 19M  10,000,000+  Free     0

      Content Rating                     Genres      Last Updated  \
0           Everyone               Art & Design   January 7, 2018
1           Everyone  Art & Design;Pretend Play  January 15, 2018
2           Everyone               Art & Design    August 1, 2018
3               Teen               Art & Design      June 8, 2018
4           Everyone    Art & Design;Creativity     June 20, 2018
...              ...                        ...               ...
10836       Everyone                  Education     July 25, 2017
10837       Everyone                  Education      July 6, 2018
10838       Everyone                    Medical  January 20, 2017
10839     Mature 17+          Books & Reference  January 19, 2015
10840       Everyone                  Lifestyle     July 25, 2018

              Current Ver         Android Ver
0                   1.0.0        4.0.3 and up
1                   2.0.0        4.0.3 and up
2                   1.2.4        4.0.3 and up
3      Varies with device          4.2 and up
4                     1.1          4.4 and up
...                   ...                 ...
10836                1.48          4.1 and up
10837                 1.0          4.1 and up
10838                 1.0          2.2 and up
10839  Varies with device  Varies with device
10840  Varies with device  Varies with device

[10841 rows x 13 columns]>